In [30]:
import pandas as pd

url = "https://drive.usercontent.google.com/download?id=1Jgto7psHaMRTAVzcFt7D6SgJiHMB7uGT"

escolas = pd.read_csv(url)

In [42]:
escolas

,ID_Escola,Nome_Escola,Tipo_Escola,Numero_Alunos,Orcamento_Anual,Gasto_Per_Capita
0,0,Escola A,Publica,2917,1910635,655.0
1,1,Escola B,Publica,2949,1884411,639.0
2,2,Escola C,Particular,1761,1056600,600.0
3,3,Escola D,Publica,4635,3022020,652.0
4,4,Escola E,Particular,1468,917500,625.0
5,5,Escola F,Particular,2283,1319574,578.0
6,6,Escola G,Particular,1858,1081356,582.0
7,7,Escola H,Publica,4976,3124928,628.0
8,8,Escola I,Particular,427,248087,581.0
9,9,Escola J,Particular,962,585858,609.0
10,10,Escola K,Particular,1800,1049400,583.0
11,11,Escola L,Publica,3999,2547363,637.0
12,12,Escola M,Publica,4761,3094650,650.0
13,13,Escola N,Publica,2739,1763916,644.0
14,14,Escola O,Particular,1635,1043130,638.0

In [31]:
escolas["Orcamento_Anual"].sum()

np.int64(24649428)

In [32]:
escolas["Gasto_Per_Capita"] = escolas["Orcamento_Anual"] / escolas["Numero_Alunos"]

In [38]:
indice_max = escolas["Gasto_Per_Capita"].max()

In [34]:
indice_min = escolas['Gasto_Per_Capita'].min()

In [39]:
indice_max

np.float64(655.0)

In [41]:
indice_min

5

In [43]:
media_alunos_por_tipo = escolas.groupby('Tipo_Escola')['Numero_Alunos'].mean()

In [44]:
media_alunos_por_tipo

Tipo_Escola
Particular    1524.250000
Publica       3853.714286
Name: Numero_Alunos, dtype: float64

In [47]:
escolas[escolas["Orcamento_Anual"] > 1500000]

,ID_Escola,Nome_Escola,Tipo_Escola,Numero_Alunos,Orcamento_Anual,Gasto_Per_Capita
0,0,Escola A,Publica,2917,1910635,655.0
1,1,Escola B,Publica,2949,1884411,639.0
3,3,Escola D,Publica,4635,3022020,652.0
7,7,Escola H,Publica,4976,3124928,628.0
11,11,Escola L,Publica,3999,2547363,637.0
12,12,Escola M,Publica,4761,3094650,650.0
13,13,Escola N,Publica,2739,1763916,644.0